using System;

namespace task_1
{
    /*Реализовать упрощенные аналоги методов LINQ:
-Where
-Select 
-Aggregate
-OrderBy (алгоритм сотрировки непринципиален, делайте как проще)*/

    /* Используйте делегаты в качестве параметров, yield для возвращения значений, перечисленные методы реализуйте в виде extension методов */
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
